In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Basics').getOrCreate()

23/05/01 10:54:01 WARN Utils: Your hostname, mia-VirtualBox resolves to a loopback address: 127.0.1.1; using 10.0.2.15 instead (on interface enp0s3)
23/05/01 10:54:01 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/05/01 10:54:02 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/05/01 10:54:03 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
23/05/01 10:54:03 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

In [3]:
resource_url = '/home/mia/Downloads/Python-and-Spark-for-Big-Data-master/'
df = spark.read.csv(
    resource_url + 'Spark_DataFrames/' + 'sales_info.csv',
    inferSchema=True,
    header=True
)

In [4]:
df.toPandas()

   Company   Person  Sales
0     GOOG      Sam  200.0
1     GOOG  Charlie  120.0
2     GOOG    Frank  340.0
3     MSFT     Tina  600.0
4     MSFT      Amy  124.0
5     MSFT  Vanessa  243.0
6       FB     Carl  870.0
7       FB    Sarah  350.0
8     APPL     John  250.0
9     APPL    Linda  130.0
10    APPL     Mike  750.0
11    APPL    Chris  350.0

In [7]:
df.printSchema()

root
 |-- Company: string (nullable = true)
 |-- Person: string (nullable = true)
 |-- Sales: double (nullable = true)

In [6]:
df.toPandas().dtypes

Company     object
Person      object
Sales      float64
dtype: object

In [8]:
df.groupBy('Company')

In [9]:
df.groupBy('Company').mean().toPandas()

  Company  avg(Sales)
0    APPL  370.000000
1    GOOG  220.000000
2      FB  610.000000
3    MSFT  322.333333

In [10]:
df.groupBy('Company').sum().toPandas()

  Company  sum(Sales)
0    APPL      1480.0
1    GOOG       660.0
2      FB      1220.0
3    MSFT       967.0

In [11]:
df.groupBy('Company').max().toPandas()

  Company  max(Sales)
0    APPL       750.0
1    GOOG       340.0
2      FB       870.0
3    MSFT       600.0

In [12]:
df.groupBy('Company').min().toPandas()

  Company  min(Sales)
0    APPL       130.0
1    GOOG       120.0
2      FB       350.0
3    MSFT       124.0

In [13]:
df.groupBy('Company').count().toPandas()

  Company  count
0    APPL      4
1    GOOG      3
2      FB      2
3    MSFT      3

In [17]:
df.agg({'Sales':'sum'}).toPandas()

   sum(Sales)
0      4327.0

In [16]:
df.agg({'Sales':'max'}).toPandas()

   max(Sales)
0       870.0

In [18]:
group_data = df.groupBy('Company')
group_data.agg({'Sales':'max'}).toPandas()

  Company  max(Sales)
0    APPL       750.0
1    GOOG       340.0
2      FB       870.0
3    MSFT       600.0

In [19]:
from pyspark.sql.functions import countDistinct, avg, stddev

In [20]:
df.select(countDistinct('Sales')).toPandas()

   count(DISTINCT Sales)
0                     11

In [21]:
df.select(avg('Sales')).toPandas()

   avg(Sales)
0  360.583333

In [23]:
df.select(avg('Sales').alias('Average Sales')).toPandas()

   Average Sales
0     360.583333

In [24]:
df.select(stddev('Sales')).toPandas()

   stddev_samp(Sales)
0          250.087424

In [25]:
from pyspark.sql.functions import format_number

In [26]:
sales_std = df.select(stddev('Sales').alias('std'))

In [28]:
sales_std.show()

+------------------+
|               std|
+------------------+
|250.08742410799007|
+------------------+

In [30]:
sales_std.select(format_number('std', 2).alias('std')).show()

+------+
|   std|
+------+
|250.09|
+------+

In [31]:
df.toPandas()

   Company   Person  Sales
0     GOOG      Sam  200.0
1     GOOG  Charlie  120.0
2     GOOG    Frank  340.0
3     MSFT     Tina  600.0
4     MSFT      Amy  124.0
5     MSFT  Vanessa  243.0
6       FB     Carl  870.0
7       FB    Sarah  350.0
8     APPL     John  250.0
9     APPL    Linda  130.0
10    APPL     Mike  750.0
11    APPL    Chris  350.0

In [32]:
df.orderBy('Sales').toPandas()

   Company   Person  Sales
0     GOOG  Charlie  120.0
1     MSFT      Amy  124.0
2     APPL    Linda  130.0
3     GOOG      Sam  200.0
4     MSFT  Vanessa  243.0
5     APPL     John  250.0
6     GOOG    Frank  340.0
7       FB    Sarah  350.0
8     APPL    Chris  350.0
9     MSFT     Tina  600.0
10    APPL     Mike  750.0
11      FB     Carl  870.0

In [33]:
df.orderBy(df['Sales'].desc()).toPandas()

   Company   Person  Sales
0       FB     Carl  870.0
1     APPL     Mike  750.0
2     MSFT     Tina  600.0
3       FB    Sarah  350.0
4     APPL    Chris  350.0
5     GOOG    Frank  340.0
6     APPL     John  250.0
7     MSFT  Vanessa  243.0
8     GOOG      Sam  200.0
9     APPL    Linda  130.0
10    MSFT      Amy  124.0
11    GOOG  Charlie  120.0

In [39]:
df.orderBy('Sales', ascending=False).toPandas()

   Company   Person  Sales
0       FB     Carl  870.0
1     APPL     Mike  750.0
2     MSFT     Tina  600.0
3       FB    Sarah  350.0
4     APPL    Chris  350.0
5     GOOG    Frank  340.0
6     APPL     John  250.0
7     MSFT  Vanessa  243.0
8     GOOG      Sam  200.0
9     APPL    Linda  130.0
10    MSFT      Amy  124.0
11    GOOG  Charlie  120.0